In [1]:
import pandas as pd
import numpy as np

dfflight = pd.read_csv('csv/c-flight-activity.csv')
dfloyalty = pd.read_csv('csv/c-loyalty-history.csv')

In [2]:
dfflight.shape

(405624, 10)

In [3]:
dfloyalty.shape

(16737, 16)

In [6]:
dfflight.sample(3)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
85874,173252,2017,6,8,8,16,2144,214.00,0,0
149629,865977,2017,9,0,0,0,0,0.00,0,0
247813,397706,2018,3,12,6,18,3240,349.92,0,0

In [7]:
dfloyalty.sample(3)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
908,173212,Canada,Quebec,Montreal,H2Y 2W2,Female,Bachelor,76014.0,Married,Aurora,5141.98,Standard,2013,4,NaN,NaN
13006,641123,Canada,Ontario,Thunder Bay,K8T 5M5,Male,College,NaN,Single,Star,4737.41,Standard,2012,12,NaN,NaN
10146,368549,Canada,Ontario,Toronto,P1J 8T7,Female,College,NaN,Married,Star,2326.86,Standard,2013,11,NaN,NaN

In [8]:
#Vamos a proceder a trabajar con una copia 

df1 = dfflight.copy()
df2 = dfloyalty.copy()

In [9]:
df1.sample(3)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
204438,187835,2018,1,0,0,0,0,0.0,0,0
380579,567082,2018,11,0,0,0,0,0.0,0,0
91238,459971,2017,6,7,0,7,2016,201.0,0,0

In [10]:
df2.sample(3)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
2771,769361,Canada,Saskatchewan,Regina,S6J 3G0,Male,Bachelor,76723.0,Married,Aurora,8828.38,Standard,2013,8,NaN,NaN
15080,969632,Canada,Quebec,Hull,J8Y 3Z5,Female,Bachelor,65935.0,Divorced,Star,8427.17,Standard,2013,2,NaN,NaN
16409,109478,Canada,Ontario,Toronto,M8Y 4K8,Male,Bachelor,84346.0,Married,Star,20998.26,Standard,2014,7,NaN,NaN

In [11]:
df1.columns = df1.columns.str.lower()
df2.columns = df2.columns.str.lower()

In [12]:
df2.sample()

,loyalty number,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month,cancellation year,cancellation month
11623,723591,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,53155.0,Married,Star,2693.66,Standard,2014,10,NaN,NaN

In [13]:
def reemplazar_guion_bajo(df):
    """
    Reemplaza los espacios en los nombres de columnas por guiones bajos usando un bucle.
    """
    nuevos_nombres = {}

    for col in df.columns:
        nuevos_nombres[col] = col.replace(' ', '_')

    df.rename(columns=nuevos_nombres, inplace=True)
    return df

In [14]:
df1 = reemplazar_guion_bajo(df1)
df2 = reemplazar_guion_bajo(df2)

In [16]:
print(df1.sample(3))
print(df2.sample(3))

        loyalty_number  year  month  flights_booked  flights_with_companions  \
263972          609650  2018      3              10                        5
280200          715668  2018      4               0                        0
7609            113316  2017      9               0                        0

        total_flights  distance  points_accumulated  points_redeemed  \
263972             15      3495              436.25                0
280200              0         0                0.00                0
7609                0         0                0.00                0

        dollar_cost_points_redeemed
263972                            0
280200                            0
7609                              0
      loyalty_number country          province         city postal_code  \
6202          355491  Canada     New Brunswick  Fredericton     E3B 2H2
3333          372111  Canada  British Columbia     Victoria     V10 6T5
2115          352242  Canada  British Columbia     Victoria     V10 6T5

      gender education   salary marital_status loyalty_card       clv  \
6202    Male  Bachelor  60805.0        Married         Star   2736.53
3333    Male   College      NaN         Single       Aurora  12255.12
2115  Female  Bachelor  83322.0        Married       Aurora   7462.93

     enrollment_type  enrollment_year  enrollment_month  cancellation_year  \
6202  2018 Promotion             2018                 3                NaN
3333        Standard             2016                 7                NaN
2115        Standard             2013                 5                NaN

      cancellation_month
6202                 NaN
3333                 NaN
2115                 NaN

In [17]:
df1 = df1.rename(columns={'loyalty_number': 'frequency_id'})

df1['frequency_id'].head()

0    100018
1    100102
2    100140
3    100214
4    100272
Name: frequency_id, dtype: int64

In [18]:
df1.insert(0, 'client_id', df1['frequency_id'])

In [19]:
df1.sample(3)

,client_id,frequency_id,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
325745,347861,347861,2018,8,11,0,11,1529,152.0,0,0
134037,401424,401424,2018,3,0,0,0,0,0.0,0,0
284265,835683,835683,2018,5,16,2,18,3438,343.0,0,0

In [20]:
# Agrupamos y sumamos valores numéricos, contamos la frecuencia en frequency_id
df1_1 = df1.groupby('client_id').agg({
    'frequency_id': 'count',  # las apariciones de frequency_id por client_id
    'flights_booked': 'sum',
    'flights_with_companions': 'sum',
    'distance': 'sum',
    'points_accumulated': 'sum',
    'points_redeemed': 'sum',
    'dollar_cost_points_redeemed': 'sum',
    'year': ['min', 'max', lambda x: x.nunique()],
}).reset_index()

# Aplanar el MultiIndex
df1_1.columns = [
    'client_id',
    'frequency_count',  # Número de veces que aparece frequency_id por client_id
    'total_flights_booked',
    'total_flights_with_companions',
    'total_distance',
    'total_points_accumulated',
    'total_points_redeemed',
    'total_dollar_cost_redeemed',
    'first_year',
    'last_year',
    'active_years'
]

# Calcular el mes más frecuente
favorite_month = df1.groupby('client_id')['month'].agg(lambda x: x.mode()[0] if not x.mode().empty else None)
favorite_month.name = 'favorite_month'
favorite_month = favorite_month.reset_index()

# Unir con merge
df1_1 = df1_1.merge(favorite_month, on='client_id', how='left')

In [21]:
df1_1.sample(3)

,client_id,frequency_count,total_flights_booked,total_flights_with_companions,total_distance,total_points_accumulated,total_points_redeemed,total_dollar_cost_redeemed,first_year,last_year,active_years,favorite_month
8847,575571,24,131,21,38428,3878.60,491,40,2017,2018,2,1
14173,859144,24,34,2,8150,814.00,0,0,2017,2018,2,1
2230,219714,24,147,45,41298,4210.75,1325,107,2017,2018,2,1

In [22]:
df1_1.head()

,client_id,frequency_count,total_flights_booked,total_flights_with_companions,total_distance,total_points_accumulated,total_points_redeemed,total_dollar_cost_redeemed,first_year,last_year,active_years,favorite_month
0,100018,24,157,35,50682,5376.00,1513,123,2017,2018,2,1
1,100102,24,173,42,40222,4115.25,1195,96,2017,2018,2,1
2,100140,24,152,38,41252,4184.25,593,48,2017,2018,2,1
3,100214,24,79,17,33982,3426.00,861,70,2017,2018,2,1
4,100272,24,127,36,40872,4108.04,1007,82,2017,2018,2,1

In [23]:
df1_1.shape

(16737, 12)

In [24]:
df2.shape

(16737, 16)

In [25]:
df1_1.rename(columns={'client_id': 'loyalty_number'}, inplace=True)

In [27]:
df_merged = pd.merge(
    df2,                  # DataFrame 2 con ID único de clientes en común
    df1_1,                # DataFrame 1
    on='loyalty_number',  # Columna común (ID)
    how='left'            
)

In [30]:
df_merged.shape

(16737, 27)

In [32]:
df_merged.columns

Index(['loyalty_number', 'country', 'province', 'city', 'postal_code',
       'gender', 'education', 'salary', 'marital_status', 'loyalty_card',
       'clv', 'enrollment_type', 'enrollment_year', 'enrollment_month',
       'cancellation_year', 'cancellation_month', 'frequency_count',
       'total_flights_booked', 'total_flights_with_companions',
       'total_distance', 'total_points_accumulated', 'total_points_redeemed',
       'total_dollar_cost_redeemed', 'first_year', 'last_year', 'active_years',
       'favorite_month'],
      dtype='object')

In [33]:
df_merged.to_csv('csv/flight-loyalty-activity.csv', index=False)

In [34]:
df_total = pd.read_csv('csv/flight-loyalty-activity.csv')

In [36]:
df_total

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,...,total_flights_booked,total_flights_with_companions,total_distance,total_points_accumulated,total_points_redeemed,total_dollar_cost_redeemed,first_year,last_year,active_years,favorite_month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,...,132,39,51877,5224.44,1418,115,2017,2018,2,1
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,...,190,25,41578,4176.04,1971,159,2017,2018,2,1
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,...,66,21,19664,1963.00,374,30,2017,2018,2,1
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,...,123,36,36043,3626.68,1291,105,2017,2018,2,1
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,...,132,44,36840,3689.68,0,0,2017,2018,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,...,126,13,40743,4070.00,0,0,2017,2018,2,1
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,...,198,45,43420,4348.76,1645,132,2017,2018,2,1
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,...,174,33,49113,4925.56,1529,124,2017,2018,2,1
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,...,128,26,41381,4166.44,0,0,2017,2018,2,1
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,...,0,0,0,0.00,0,0,2017,2018,2,1

## Gestión de nulos

In [ ]:
df_total['salary'] = df_total['salary'].abs()
df_total['salary'].unique()

#Había por ahí valores negativos

array([ 83236.,     nan, 103495., ...,  76178.,  91970.,  57297.],
      shape=(5891,))

In [ ]:
df_total['favorite_month'].unique() 
# aquí ha habido un error de cálculos con 'favorite_month', me temo
# next steps, reemplazarlo por el valor que corresponde

array([1])

In [41]:
df_total.isnull().sum()

loyalty_number                       0
country                              0
province                             0
city                                 0
postal_code                          0
gender                               0
education                            0
salary                            4238
marital_status                       0
loyalty_card                         0
clv                                  0
enrollment_type                      0
enrollment_year                      0
enrollment_month                     0
cancellation_year                14670
cancellation_month               14670
frequency_count                      0
total_flights_booked                 0
total_flights_with_companions        0
total_distance                       0
total_points_accumulated             0
total_points_redeemed                0
total_dollar_cost_redeemed           0
first_year                           0
last_year                            0
active_years                         0
favorite_month                       0
dtype: int64

In [55]:
# cancellation_year

df_total['active_member'] = df_total['cancellation_year'].isna()

In [56]:
cols = [
    'loyalty_number',
    'frequency_count',
    'total_flights_booked',
    'total_flights_with_companions',
    'total_distance',
    'loyalty_card',
    'clv',
    'enrollment_type',
    'enrollment_year',
    'enrollment_month',
    'active_member',  
    'cancellation_year',
    'cancellation_month',
    'total_points_accumulated',
    'total_points_redeemed',
    'total_dollar_cost_redeemed',
    'first_year',
    'last_year',
    'active_years',
    'favorite_month',
    'country',
    'province',
    'city',
    'postal_code',
    'gender',
    'education',
    'salary',
    'marital_status',
]

In [57]:
df_total = df_total[cols]

In [58]:
df_total.columns.tolist()

['loyalty_number',
 'frequency_count',
 'total_flights_booked',
 'total_flights_with_companions',
 'total_distance',
 'loyalty_card',
 'clv',
 'enrollment_type',
 'enrollment_year',
 'enrollment_month',
 'active_member',
 'cancellation_year',
 'cancellation_month',
 'total_points_accumulated',
 'total_points_redeemed',
 'total_dollar_cost_redeemed',
 'first_year',
 'last_year',
 'active_years',
 'favorite_month',
 'country',
 'province',
 'city',
 'postal_code',
 'gender',
 'education',
 'salary',
 'marital_status']

In [59]:
df_total.isnull().sum()

loyalty_number                       0
frequency_count                      0
total_flights_booked                 0
total_flights_with_companions        0
total_distance                       0
loyalty_card                         0
clv                                  0
enrollment_type                      0
enrollment_year                      0
enrollment_month                     0
active_member                        0
cancellation_year                14670
cancellation_month               14670
total_points_accumulated             0
total_points_redeemed                0
total_dollar_cost_redeemed           0
first_year                           0
last_year                            0
active_years                         0
favorite_month                       0
country                              0
province                             0
city                                 0
postal_code                          0
gender                               0
education                            0
salary                            4238
marital_status                       0
dtype: int64

In [ ]:
# Dejaremos los nulos tal cual están, no implican mayor sesgo

In [60]:
df_total.to_csv('csv/flight-loyalty-activity.csv', index=False)